# FlatOnTop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..FlatOnTop Property
DuctSettings Class See Also
---
The abbreviation of the Flat On Top (FOT) string.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string FlatOnTop { get; set; }
```

Visual Basic
---
```text
Public Property FlatOnTop As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FlatOnTop {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace